#ifndef INPUT_H
#define INPUT_H

/// @file Input.h

//{----------------------------------------------------------------------------
/// \brief Функция для ввода коэффицентов
///
/// \param *a указатель на первый коэффицент квадратного уравнения
/// \param *b указатель на второй коэффицент квадратного уравнения
/// \param *c указатель на третий коэффицент квадратного уравнения
///
/// \note При некорректном вводе данных,
///       программа просит пользователя повторно их ввести
///
/// \warning Эта функция изменяет значения вводимых переменных
//}----------------------------------------------------------------------------

void EnterCoefficient (double *a, double *b, double *c);

//{----------------------------------------------------------------------------
/// \brief Функция для вывода решений квадратного уравнения
/// \param numSolutions количество решений
/// \param *solutions массив рещений уравнения
//}----------------------------------------------------------------------------

void PrintSolutions (int numSolutions, double *solutions);

//{----------------------------------------------------------------------------
/// \brief Функция для очистки буффера вводимых данных
//}----------------------------------------------------------------------------

void ClearBuffer();

//-----------------------------------------------------------------------------

#endif
